////////////////////////////////////////////////////////////////////////////////
//
// Изогеометрическое моделирование кривых высокого качества по критериям плавности.
//
////////////////////////////////////////////////////////////////////////////////

#ifndef __TEST_FAIR_CURVE_H
#define __TEST_FAIR_CURVE_H

#include <mb_data.h>
#include <cur_nurbs3d.h>
#include <tool_cstring.h>


//------------------------------------------------------------------------------
// Программа для отладки, тестирования и демонстрации функциональных возможностей комплекса 
// программ изогеометрического моделирования  кривых высокого качества по критериям плавности.
// ---
void CreateFairCurve( int type );


//-----------------------------------------------------------------------------     
// Чтение 3D полилинии
//---
int ReadPllne( MbCurve3D *& pllne, bool & closed, size_t & n ); 


//-----------------------------------------------------------------------------     
// Чтение 3D полилинии
//---
c3d::SpaceCurveSPtr ReadPolyline( bool & closed, size_t & n, int & err );


//----------------------------------------------------------------------------------------
///< \ru  Вывести сообщение по номеру ошибки. \en Display a message by error number.
// ---
const c3d::string_t & MessageError( int number );


//----------------------------------------------------------------------------------------
///< \ru  Вывести сообщение по номеру предупреждения. \en Display a message by warning number.
// ---
const c3d::string_t & MessageWarning( int number );


//---------------------------------------------------------------------------------- 
// Анализ строки с параметрами.
//---
size_t AnalizeLine( char   stroke[],
                    char * p[],
                    int    max_p,
                    size_t & fact );


//------------------------------------------------------------------------------
// Открыть файл для отладочной печати.
// ---
int InitFcm();


//------------------------------------------------------------------------------
// Закрыть файл для отладочной печати.
// ---
int CloseFcm();

#endif // __TEST_FAIR_CURVE_H
